# Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.

a=input("Введите трехзначное число: ")
print("Сумма цифр: " + str(int(a[0])+int(a[1])+int(a[2])))
print("Произведение цифр: " + str(int(a[0])*int(a[1])*int(a[2])))

