# Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

temp=int(input("Введите номер буквы: "))

print("Буква: " + chr(temp))
